{"extracted_information": "La WebCodecs API proporciona a los desarrolladores web acceso de bajo nivel a los fotogramas individuales de una transmisión de video y a los fragmentos de audio. Es útil para aplicaciones web que requieren control total sobre el procesamiento de medios, como editores de video/audio y videoconferencias. A diferencia de enfoques con WebAssembly, utiliza códecs ya presentes en el navegador, reduciendo ancho de banda, mejorando rendimiento y eficiencia energética, y disminuyendo la sobrecarga de desarrollo.", "specifications": {}, "pricing": {}, "features": [{"name": "Acceso de bajo nivel", "description": "Acceso a fotogramas individuales de video y fragmentos de audio."}, {"name": "Códecs internos del navegador", "description": "Utiliza códecs ya disponibles en el navegador, evitando la necesidad de descargar códecs adicionales."}, {"name": "Datos de medios sin procesar", "description": "Acceso a fotogramas de video sin procesar, fragmentos de datos de audio, decodificadores de imagen y codificadores/decodificadores de audio/video."}, {"name": "Modelo de procesamiento asíncrono", "description": "Cada instancia de codificador o decodificador mantiene una cola de procesamiento interna e independiente. Métodos como `configure()`, `encode()`, `decode()` y `flush()` operan asincrónicamente. `reset()` y `close()` abortan el trabajo pendiente sincrónicamente."}, {"name": "Disponibilidad en Web Workers dedicados", "description": "La característica está disponible en Dedicated Web Workers."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [], "functionalities": {"interfaces": [{"name": "AudioDecoder", "description": "Decodifica objetos EncodedAudioChunk."}, {"name": "VideoDecoder", "description": "Decodifica objetos EncodedVideoChunk."}, {"name": "AudioEncoder", "description": "Codifica objetos AudioData."}, {"name": "VideoEncoder", "description": "Codifica objetos VideoFrame."}, {"name": "EncodedAudioChunk", "description": "Representa bytes de audio codificados específicos del códec."}, {"name": "EncodedVideoChunk", "description": "Representa bytes de video codificados específicos del códec."}, {"name": "AudioData", "description": "Representa datos de audio sin codificar."}, {"name": "VideoFrame", "description": "Representa un fotograma de datos de video sin codificar."}, {"name": "VideoColorSpace", "description": "Representa el espacio de color de un fotograma de video."}, {"name": "ImageDecoder", "description": "Desempaqueta y decodifica datos de imagen, dando acceso a la secuencia de fotogramas en una imagen animada."}, {"name": "ImageTrackList", "description": "Representa la lista de pistas disponibles en la imagen."}, {"name": "ImageTrack", "description": "Representa una pista de imagen individual."}]}, "browser_compatibility": {"status": "No se proporcionan detalles específicos de compatibilidad con navegadores en el contenido, solo se menciona que la característica está disponible en Dedicated Web Workers."}, "usage_examples": {"video_processing": "El ejemplo de código muestra la codificación de fotogramas de video obtenidos de un `MediaStreamTrackProcessor`. Si el `encoder.encodeQueueSize` es demasiado grande (ej. > 2), los fotogramas se descartan para evitar saturar el codificador. Los fotogramas pueden ser codificados como keyframes periódicamente (ej. cada 150 fotogramas).", "references": ["https://developer.chrome.com/docs/web-platform/best-practices/webcodecs", "https://w3c.github.io/webcodecs/samples/", "https://webrtchacks.com/real-time-video-processing-with-webcodecs-and-streams-processing-pipelines-part-1/", "https://webrtchacks.com/video-frame-processing-on-the-web-webassembly-webgpu-webgl-webcodecs-webnn-and-webtransport/"]}, "limitations": ["No hay una API actual para desmultiplexar contenedores de medios; los desarrolladores necesitan implementar su propia lógica o usar librerías de terceros como MP4Box.js o jswebm.", "Llamar a `flush()` innecesariamente puede afectar la calidad del codificador y hacer que los decodificadores requieran que la siguiente entrada sea un fotograma clave."], "advantages": ["Proporciona acceso a códecs que ya existen en el navegador.", "Reduce el ancho de banda adicional al no necesitar descargar códecs que ya están presentes.", "Mejora el rendimiento y la eficiencia energética en comparación con el uso de WebAssembly para el procesamiento de medios.", "Reduce la sobrecarga de desarrollo en comparación con soluciones basadas en WebAssembly."]}