{"extracted_information": "Se ha extraído información detallada sobre los términos de uso, planes, limitaciones y algunas restricciones de la API de Windy. Sin embargo, no se especifican precios exactos en el contenido proporcionado, sino que se remite a la 'Website' para la información de tarifas.", "specifications": {"api_access_method": "HTTPS (Hypertext Transfer Protocol Secure)", "api_design": "Para uso en navegador web, utiliza Javascript, HTML y CSS", "internet_connection_required": true, "technical_support": "No incluido en el acuerdo, se recomienda la comunidad Windy para consultas.", "availability_guarantee": "No se garantiza la funcionalidad completa, disponibilidad o calidad de los Servicios y su Contenido.", "access_authentication": "API Key única, creada tras registro de usuario.", "api_key_management": "Gestionable en el sitio web, no se permiten modificaciones de la API Key.", "monitoring_logging": "El Proveedor se reserva el derecho de monitorear y registrar el acceso y las actividades del Usuario.", "api_key_confidentiality_private_app": "Confidencial, uso exclusivo del Usuario o empleados; prohibido compartir con terceros.", "api_key_public_app_usage": "Solo utilizable desde User Domains especificados."}, "pricing": {"fees_details": "Para la versión Profesional, el Usuario se compromete a pagar las tarifas especificadas en la 'Website' (las 'Fees').", "payment_method": "Suscripción anual anticipada, cobrada a través de un tercero.", "automatic_renewal": "Al adquirir una suscripción, se autoriza al Proveedor a realizar cargos automáticamente cada año hasta la cancelación."}, "features": [{"plan_type": "Versión de Prueba (Trial Version)", "availability": "Gratuita", "purpose": "Solo para fines de desarrollo, no permitida para producción o integración en aplicaciones de usuario.", "map_forecast_api": "Contiene Map Visualizations y Other API Endpoints Services.", "point_forecast_api": "Devuelve datos legibles por máquina sobre pronósticos meteorológicos para coordenadas aleatorias."}, {"plan_type": "Versión Profesional (Professional Version)", "availability": "De pago", "purpose": "Recomendada para las circunstancias más exigentes, creada para clientes corporativos y proyectos extensos.", "restricted_models_usage_ecmwf": "Limitado solo a la Aplicación Privada. No autorizado para pasar servicios a terceros ni usarlos para generar Servicios de Valor Añadido.", "upgrade_process": "Actualización disponible en el Sitio Web.", "map_forecast_api": "Contiene Map Visualizations y Other API Endpoints Services.", "point_forecast_api": "Devuelve datos legibles por máquina sobre pronósticos meteorológicos para un conjunto especificado de coordenadas."}], "statistics": {"traffic_usage_limits": {"trial_version": {"sessions_per_day": 500, "exceeded_limit_action": "El Proveedor puede dejar de proporcionar los Servicios por el resto del día. El exceder repetidamente el límite puede llevar a una notificación y posterior terminación del acuerdo."}, "professional_version": {"sessions_per_day": 10000, "exceeded_limit_action": "El Proveedor puede dejar de proporcionar los Servicios por el resto del día. El exceder repetidamente el límite puede llevar a una notificación y posterior terminación del acuerdo.", "limit_increase_option": "El límite puede aumentarse mediante acuerdo, contactar a api@windy.com."}}}, "temporal_info": {"terms_of_use_effective_date": "5 de mayo de 2020", "latest_update_effective_date": "1 de septiembre de 2023"}, "geographical_data": {"provider_registered_office": "Strakonická 3363/2d, 150 00 Prague 5, República Checa"}, "references": [{"description": "Términos Generales de Uso de los Servicios de Windy", "url": "https://account.windy.com/agreements/windy-general-terms-of-use"}, {"description": "Resumen de todos los términos de uso y documentos informativos de Windy", "url": "https://account.windy.com/agreements/overview-of-all-terms-of-use"}, {"description": "Contacto para aumento de límites en la versión profesional", "url": "mailto:api@windy.com"}]}